import type { GlossaryPhases } from "@/lib/glossaryPhases";

export type GlossaryItem = {
  term: string;
  definition: string;
  phase: GlossaryPhases;
  example?: string;
};

export const glossary: GlossaryItem[] = [
  {
    term: "UX Research",
    definition:
      "Ensemble de méthodes utilisées pour comprendre les comportements, les besoins et les motivations des utilisateurs afin de guider les décisions produit.",
    phase: "Discovery",
    example:
      "Nous avons mené des interviews utilisateurs pour recueillir des insights sur leurs attentes vis-à-vis de la nouvelle fonctionnalité.",
  },
  {
    term: "Personas",
    definition:
      "Profils fictifs représentant les types d'utilisateurs cibles, créés à partir de données réelles pour guider le développement produit.",
    phase: "Discovery",
    example:
      "Nous avons créé des personas pour représenter nos utilisateurs cibles, ce qui nous a aidés à mieux comprendre leurs besoins.",
  },
  {
    term: "Product Discovery",
    definition:
      "Phase amont de la conception produit permettant d’identifier les besoins utilisateurs, les opportunités business et les solutions à explorer.",
    phase: "Discovery",
    example:
      "La phase de product discovery a révélé que les utilisateurs avaient besoin d'une fonctionnalité de recherche avancée.",
  },
  {
    term: "Product-Market Fit",
    definition:
      "Alignement entre le produit développé et les attentes réelles du marché, souvent mesuré par la satisfaction et la rétention des utilisateurs.",
    phase: "Discovery",
    example:
      "Nous avons atteint le product-market fit lorsque 80% de nos utilisateurs ont déclaré que notre produit répondait parfaitement à leurs besoins.",
  },
  {
    term: "OKR (Objectives & Key Results)",
    definition:
      "Cadre de définition d’objectifs clairs et mesurables pour aligner les équipes sur des résultats concrets et ambitieux.",
    phase: "Discovery",
    example:
      "Notre objectif pour le trimestre est d'augmenter le taux de rétention de 20% grâce à l'amélioration de l'expérience utilisateur.",
  },
  {
    term: "KPI (Key Performance Indicator)",
    definition:
      "Indicateur chiffré permettant de mesurer la performance du produit ou l’avancement des objectifs.",
    phase: "Discovery",
    example:
      "Le taux de conversion est un KPI clé pour évaluer l'efficacité de notre page d'inscription.",
  },
  {
    term: "Heatmap",
    definition:
      "Outil de visualisation du comportement utilisateur (clics, scrolls, mouvements) pour identifier les zones d’intérêt et les points de friction sur une interface.",
    phase: "Discovery",
    example:
      "La heatmap a révélé que les utilisateurs cliquaient principalement sur le bouton d'inscription, mais ignoraient la section des témoignages.",
  },
  {
    term: "Roadmap",
    definition:
      "Vision macro. Vue d'ensemble des grands jalons et objectifs produits sur une période donnée (trimestres, semestres…).",
    phase: "Vision Produit",
    example:
      "La roadmap produit pour le prochain trimestre inclut le lancement de la nouvelle fonctionnalité de recherche et l'amélioration de l'expérience utilisateur.",
  },
  {
    term: "MVP",
    definition:
      "Produit Minimum Viable : version initiale d’un produit avec juste assez de fonctionnalités pour satisfaire les premiers utilisateurs et recueillir des feedbacks.",
    phase: "Vision Produit",
    example:
      "Nous avons lancé un MVP avec les fonctionnalités essentielles pour tester notre concept sur le marché.",
  },
  {
    term: "Lean",
    definition:
      "Méthodologie visant à maximiser la valeur tout en minimisant le gaspillage, souvent associée à l'approche Agile.",
    phase: "Vision Produit",
    example:
      "Nous avons appliqué les principes Lean pour optimiser notre processus de développement et réduire le temps de mise sur le marché.",
  },
  {
    term: "Epic",
    definition:
      "Grande fonctionnalité regroupant plusieurs User Stories liées à un même objectif produit.",
    phase: "Vision Produit",
    example:
      "L'Epic 'Amélioration de la recherche' inclut des User Stories pour le filtrage, le tri et l'affichage des résultats.",
  },
  {
    term: "Design System",
    definition:
      "Bibliothèque de composants UI réutilisables accompagnée de règles et de bonnes pratiques assurant la cohérence visuelle et fonctionnelle du produit.",
    phase: "Design & Cadrage",
    example:
      "Le design system de notre application inclut des composants comme des boutons, des formulaires et des modales, ainsi que des directives sur leur utilisation.",
  },
  {
    term: "User Story",
    definition:
      "Fonctionnalité décrite du point de vue de l'utilisateur final, souvent sous forme : 'En tant que... je veux... afin de...'.",
    phase: "Design & Cadrage",
    example:
      "En tant qu'utilisateur, je veux pouvoir me connecter avec mon adresse e-mail et mon mot de passe afin d'accéder à mon compte.",
  },
  {
    term: "Acceptance Criteria",
    definition:
      "Conditions précises à remplir pour qu'une User Story soit considérée comme terminée. Ils définissent les attentes fonctionnelles et non fonctionnelles.",
    phase: "Design & Cadrage",
    example:
      "Les critères d'acceptation pour cette User Story incluent : l'utilisateur doit pouvoir se connecter avec son adresse e-mail et son mot de passe, et recevoir un message d'erreur en cas d'échec.",
  },
  {
    term: "Prioritization (MoSCoW)",
    definition:
      "Méthode de priorisation : Must have / Should have / Could have / Won't have",
    phase: "Design & Cadrage",
    example:
      "Nous avons utilisé la méthode MoSCoW pour prioriser les fonctionnalités du MVP : 'Must have' pour les fonctionnalités essentielles, 'Should have' pour celles qui apportent une valeur ajoutée, 'Could have' pour les options intéressantes mais non critiques, et 'Won't have' pour celles à exclure.",
  },
  {
    term: "Backlog Grooming",
    definition:
      "Processus d'affinage et de priorisation du Product Backlog, souvent réalisé en continu.",
    phase: "Design & Cadrage",
    example:
      "Lors du backlog grooming, l'équipe a discuté des User Stories à venir et a ajusté les priorités en fonction des retours des utilisateurs.",
  },
  {
    term: "Product Backlog",
    definition:
      "Liste ordonnée de toutes les fonctionnalités, améliorations, corrections ou idées pouvant être intégrées au produit. Gérée et priorisée par le Product Owner.",
    phase: "Design & Cadrage",
    example:
      "Le Product Backlog contient toutes les User Stories, bugs et améliorations à réaliser pour le produit.",
  },
  {
    term: "Definition of Done (DoD)",
    definition:
      "Ensemble clair de critères que chaque User Story ou fonctionnalité doit remplir pour être considérée comme terminée et prête à être livrée. Cela inclut souvent des tests, la documentation, la validation par le Product Owner, et d'autres exigences spécifiques à l'équipe ou au projet.",
    phase: "Design & Cadrage",
    example:
      "La DoD pour cette User Story inclut : code revu, tests unitaires écrits, documentation mise à jour et validation par le Product Owner.",
  },
  {
    term: "Story Points",
    definition:
      "Unité d'estimation relative de l'effort requis pour développer une User Story.",
    phase: "Planification & Estimation",
    example:
      "Nous avons estimé cette User Story à 5 Story Points, ce qui correspond à une complexité moyenne.",
  },
  {
    term: "Capacity",
    definition:
      "Charge de travail que l'équipe peut absorber sur un sprint, en fonction de ses disponibilités.",
    phase: "Planification & Estimation",
    example:
      "L'équipe a une capacité de 40 heures par semaine, ce qui nous permet de planifier 20 Story Points pour le prochain sprint.",
  },
  {
    term: "Velocity",
    definition:
      "Nombre moyen de Story Points livrés par l’équipe à chaque sprint (vitesse de livraison).",
    phase: "Planification & Estimation",
    example:
      "Notre vélocité est de 30 Story Points par sprint, ce qui nous permet de planifier efficacement nos prochaines itérations.",
  },
  {
    term: "Timeline",
    definition:
      "Représentation visuelle et chronologique des jalons, tâches ou releases prévues dans le projet.",
    phase: "Planification & Estimation",
    example:
      "La timeline du projet montre que la phase de développement s'étendra de janvier à mars, suivie d'une phase de test en avril.",
  },
  {
    term: "Spike",
    definition:
      "Tâche exploratoire visant à rechercher, analyser ou tester une solution technique avant de s'engager sur un développement.",
    phase: "Planification & Estimation",
    example:
      "Nous avons réalisé un Spike pour évaluer la faisabilité d'une nouvelle API avant de l'intégrer dans le produit.",
  },
  {
    term: "Refinement",
    definition:
      "Moment où l’équipe discute, découpe, clarifie et estime les User Stories en préparation d’un sprint futur.",
    phase: "Planification & Estimation",
    example:
      "Lors du refinement, nous avons découpé l'Epic en plusieurs User Stories et les avons estimées en Story Points.",
  },
  {
    term: "Sprint Planning",
    definition:
      "Cérémonie Scrum où l'équipe définit les User Stories à réaliser durant le sprint en fonction de la priorité et de la capacité.",
    phase: "Planification & Estimation",
    example:
      "Lors du Sprint Planning, nous avons sélectionné les User Stories prioritaires pour le sprint à venir et estimé leur complexité.",
  },
  {
    term: "Sprint Board",
    definition:
      "Tableau Kanban utilisé pour visualiser l’état des tâches pendant un sprint (To Do / In Progress / In Test / Done).",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "Nous avons mis à jour le Sprint Board pour refléter l'avancement des tâches et identifier les blocages.",
  },
  {
    term: "Kanban",
    definition:
      "Méthode de gestion visuelle du travail, permettant de suivre l'avancement des tâches et d'optimiser le flux de travail.",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "Nous avons utilisé un tableau Kanban pour visualiser le flux de travail et limiter le nombre de tâches en cours.",
  },
  {
    term: "Daily Scrum (Stand-up)",
    definition:
      "Réunion quotidienne de l’équipe pour synchroniser les efforts, lever les blocages et adapter le plan de travail.",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "Lors du Daily Scrum, chaque membre de l'équipe a partagé ses progrès, ses obstacles et ses priorités pour la journée.",
  },
  {
    term: "Increment",
    definition:
      "Version fonctionnelle et potentiellement livrable du produit à la fin d’un sprint.",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "À la fin du sprint, nous avons livré un incrément de produit contenant trois nouvelles fonctionnalités.",
  },
  {
    term: "Iterative",
    definition:
      "Approche de développement basée sur des cycles courts et répétés (sprints), permettant des ajustements réguliers.",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "Nous avons adopté une approche itérative pour développer la nouvelle fonctionnalité, en livrant des versions intermédiaires à chaque sprint.",
  },
  {
    term: "Sprint Review",
    definition:
      "Réunion de fin de sprint où l’équipe présente le travail terminé aux parties prenantes pour obtenir du feedback.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Lors de la revue de sprint, l'équipe a présenté la nouvelle fonctionnalité de recherche et a recueilli des retours sur son utilisation.",
  },
  {
    term: "Sprint Retrospective",
    definition:
      "Réunion permettant à l’équipe d’identifier ce qui a bien fonctionné, ce qui peut être amélioré, et de définir des actions concrètes pour le sprint suivant.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Lors de la rétrospective, l'équipe a décidé d'améliorer la communication en utilisant un canal Slack dédié aux questions techniques.",
  },
  {
    term: "Burndown & Burn-up Charts",
    definition:
      "Graphiques représentant le travail restant (burndown) ou accompli (burn-up) au fil du temps.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Le burndown chart montre que nous avons réduit le travail restant de 50% au cours du sprint.",
  },
  {
    term: "Feature Flag (Toggle)",
    definition:
      "Mécanisme permettant d’activer ou désactiver des fonctionnalités dans un produit sans redéploiement.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Nous avons utilisé un feature flag pour tester la nouvelle fonctionnalité auprès d'un sous-ensemble d'utilisateurs avant de la déployer à tous.",
  },
  {
    term: "Release",
    definition:
      "Livraison d'une ou plusieurs fonctionnalités en production, prête(s) à être utilisée(s) par les utilisateurs finaux.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "La version 2.0 de l'application a été publiée avec de nouvelles fonctionnalités et des améliorations de performance.",
  },
  {
    term: "CI/CD (Continuous Integration / Continuous Deployment)",
    definition:
      "Pratiques DevOps permettant d’intégrer et de déployer le code de manière fréquente, fiable et automatisée.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Nous avons mis en place un pipeline CI/CD pour automatiser les tests et le déploiement de notre application à chaque commit.",
  },
  {
    term: "Technical Debt",
    definition:
      "Compromis techniques à court terme qui peuvent ralentir le développement futur ou créer des problèmes de maintenance si non traités.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Nous avons accumulé une certaine dette technique en choisissant une solution rapide pour respecter la deadline, mais nous devrons y revenir plus tard.",
  },
  {
    term: "Tests A/B",
    definition:
      "Méthode d'expérimentation permettant de comparer deux versions d’un élément (page, bouton, fonctionnalité…) auprès d’utilisateurs pour identifier celle qui génère les meilleures performances (taux de clic, conversion…).",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Nous avons réalisé un test A/B sur la couleur du bouton d'appel à l'action pour voir laquelle générait le plus de clics.",
  },
  {
    term: "Product Owner",
    definition:
      "Responsable de la vision produit et de la gestion du Product Backlog, garantissant la valeur business. Il est l’interface entre l’équipe et les parties prenantes, tout en gardant l'alignement entre les besoins utilisateurs, l'objectif business et les contraintes techniques.",
    phase: "Rôles clés",
    example:
      "Le Product Owner a priorisé les User Stories pour le prochain sprint en fonction des retours des utilisateurs et des objectifs stratégiques.",
  },
  {
    term: "Scrum Master",
    definition:
      "Facilitateur du cadre Scrum, veille à la bonne application des principes et au bon fonctionnement de l’équipe.",
    phase: "Rôles clés",
    example:
      "Le Scrum Master a organisé une rétrospective pour discuter des défis rencontrés lors du dernier sprint.",
  },
  {
    term: "Tech lead",
    definition:
      "Référent technique de l'équipe de développement, garant des choix d’architecture et des bonnes pratiques.",
    phase: "Rôles clés",
    example:
      "Le tech lead a proposé une nouvelle architecture pour améliorer la scalabilité de l'application.",
  },
  {
    term: "Agent",
    definition:
      "Un composant ou programme qui agit en tant qu’intermédiaire ou représentant pour accomplir une tâche spécifique.",
    phase: "Vision Produit",
    example:
      "L'agent de support client utilise un modèle de langage pour répondre aux questions des utilisateurs.",
  },
  {
    term: "RAG (Retrieve and Generate)",
    definition:
      "Dans le contexte de l’IA, RAG (Retrieve and Generate) désigne une approche combinant la récupération d’informations pertinentes dans une base de données (Retrieve) avec la génération de réponses textuelles à l’aide d’un modèle de langage (Generate).",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "Nous avons utilisé une approche RAG pour améliorer la pertinence des réponses générées par notre assistant virtuel.",
  },
  {
    term: "Orchestration",
    definition:
      "La coordination et la gestion de plusieurs processus ou services pour qu’ils fonctionnent ensemble de manière harmonieuse, souvent dans des environnements complexes.",
    phase: "Planification & Estimation",
    example:
      "L'orchestration des microservices permet de gérer efficacement les interactions entre différents composants d'une application.",
  },
  {
    term: "LLM vecteur",
    definition:
      "Un vecteur généré par un modèle de langage de grande taille (Large Language Model), utilisé pour représenter des mots, des phrases ou des documents dans un espace numérique afin de faciliter des comparaisons ou des recherches.",
    phase: "Discovery",
    example:
      "Nous avons utilisé un LLM vecteur pour améliorer la recherche sémantique dans notre application.",
  },
  {
    term: "Discovery design",
    definition:
      "Une phase initiale dans le développement de produits ou services où l’objectif est de comprendre les besoins des utilisateurs, d’identifier les opportunités et de définir les priorités avant de passer à la conception détaillée.",
    phase: "Discovery",
    example:
      "Le discovery design a révélé que les utilisateurs avaient besoin d'une interface plus intuitive pour naviguer dans l'application.",
  },
  {
    term: "Design thinking",
    definition:
      "Une approche centrée sur l’humain pour résoudre des problèmes en encourageant la créativité, l’expérimentation, et une compréhension approfondie des besoins des utilisateurs à travers des étapes comme l’empathie, la définition, l’idéation, le prototypage, et le test.",
    phase: "Design & Cadrage",
    example:
      "Le design thinking nous a permis de mieux comprendre les besoins des utilisateurs avant de concevoir la nouvelle fonctionnalité.",
  },
  {
    term: "Shurn",
    definition:
      "Ce terme désigne souvent le taux de perte de clients ou d’utilisateurs dans un service ou une plateforme.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Le churn des utilisateurs a augmenté après la mise à jour de l'interface utilisateur.",
  },
  {
    term: "Verbatim",
    definition:
      "Le mot à mot ou la transcription exacte des propos ou contenus exprimés, souvent utilisé dans le contexte d’entretiens ou d’enquêtes pour représenter fidèlement les réponses ou commentaires des participants.",
    phase: "Discovery",
    example:
      "Le verbatim des utilisateurs a révélé des frustrations concernant la navigation sur le site.",
  },
  {
    term: "Interview",
    definition:
      "Une méthode de collecte d’informations ou d’opinions impliquant une interaction directe entre un interviewer et un interviewé.",
    phase: "Discovery",
    example:
      "Nous avons réalisé des interviews avec des utilisateurs pour comprendre leurs besoins et attentes vis-à-vis de la nouvelle fonctionnalité.",
  },
  {
    term: "Feedback",
    definition:
      "Les commentaires, observations ou informations donnés en retour par un utilisateur, un client ou un pair afin d’évaluer, améliorer ou ajuster un produit, un service ou une performance.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Les utilisateurs ont signalé que la nouvelle fonctionnalité de recherche était lente et peu intuitive.",
  },
  {
    term: "Delivery Tracking",
    definition:
      "Suivi de l’avancement des livraisons produit, notamment via la vélocité, les tâches livrées par sprint et les écarts entre planification et exécution.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Le Sprint 3 a livré 8 user stories sur 10 avec un taux de complétion de 80%.",
  },
  {
    term: "Documentation produit",
    definition:
      "Ensemble des documents décrivant les spécifications fonctionnelles, les parcours utilisateurs, les règles métier, ainsi que les décisions produit.",
    phase: "Suivi, validation & amélioration continue",
    example:
      "Les user stories sont rédigées dans Jira et détaillées dans Confluence, avec un lien vers les wireframes Figma.",
  },
  {
    term: "Wireframe (Zoning ↦ Wireframe ↦ Mockup ↦ Prototype)",
    definition:
      "Représentation visuelle simplifiée d’une interface utilisateur, montrant la structure, la disposition et les éléments clés sans se soucier des détails graphiques (style visuel ou des couleurs).",
    phase: "Design & Cadrage",
    example:
      "Le wireframe de la page d'accueil montre l'emplacement du menu, du hero (avec CAT) du contenu principal et du pied de page.",
  },
  {
    term: "Prototype (Zoning ↦ Wireframe ↦ Mockup ↦ Prototype)",
    definition:
      "Modèle interactif d’un produit ou d’une fonctionnalité, permettant de tester et valider des concepts avant le développement final, à travers des interactions simulées",
    phase: "Design & Cadrage",
    example:
      "Nous avons créé un prototype interactif pour tester la navigation de l'application avant de commencer le développement.",
  },
  {
    term: "Product D&E (Development & Engineering)",
    definition:
      "Processus de développement et d'ingénierie du produit, englobant la conception, le développement, les tests et la mise en production.",
    phase: "Exécution Agile (Scrum/Kanban)",
    example:
      "L'équipe de D&E a travaillé sur l'intégration de la nouvelle API pour améliorer les performances de l'application.",
  },
  {
    term: "Zoning (Zoning ↦ Wireframe ↦ Mockup ↦ Prototype)",
    definition:
      "Processus de planification et de conception d'un espace ou d'une interface, en définissant les zones fonctionnelles et leur agencement. Le zoning est souvent basse fidélité (gris, blocs)",
    phase: "Design & Cadrage",
    example:
      "Le zoning de la page d'accueil a été réalisé pour déterminer l'emplacement des sections principales : header, contenu, sidebar et footer.",
  },
  {
    term: "Mockup (Zoning ↦ Wireframe ↦ Mockup ↦ Prototype)",
    definition:
      "Représentation visuelle statique d’un produit ou d’une interface, montrant le design final, les couleurs, les polices et les éléments graphiques sans interactivité.",
    phase: "Design & Cadrage",
    example:
      "Le mockup de la page d'accueil montre le design final avec les couleurs et les polices choisies.",
  },
];
